Dynamite1847/ESP32_Monitor/firmware/sdkconfig.defaults
# ESP32-S3 N16R8 board baseline
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU and scheduler
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 任务看门狗：卡死时 panic → 自恢复重启（而非硬挂）。超时给足 10s 覆盖
# 字体后台加载与 TLS 握手的 CPU 尖峰，避免 idle 短暂饿死误触发。
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# 8 MB octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_SPI_FLASH_HPM_ENA=y

# microSD paths and human-readable rotated log filenames
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=96

# BLE-only peripheral transport: one bonded Mac, Secure Connections, MTU 247
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# NimBLE host memory in PSRAM: Wi-Fi + BLE together exhaust internal RAM,
# and the BT controller needs a ~30 KB contiguous internal DMA block
# (observed "BLE assert emi.c" / "Malloc failed" on 4.3B otherwise).
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
# CONFIG_BT_NIMBLE_GATT_CLIENT is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
# CONFIG_BT_NIMBLE_SM_LEGACY is not set
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
# Codex desktop recognizes the open Codex Micro vendor-HID shape. Two report
# characteristics carry 63-byte JSON input/output bodies with report ID 6.
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_INSTANCES=2
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=3
CONFIG_BT_NIMBLE_BAS_SERVICE=y
CONFIG_BT_NIMBLE_SVC_BAS_BATTERY_LEVEL_NOTIFY=y
CONFIG_BT_NIMBLE_DIS_SERVICE=y
CONFIG_BT_NIMBLE_SVC_DIS_MANUFACTURER_NAME=y
CONFIG_BT_NIMBLE_SVC_DIS_FIRMWARE_REVISION=y
CONFIG_BT_NIMBLE_SVC_DIS_PNP_ID=y

# Wi-Fi buffers kept modest: desk console traffic is small periodic HTTPS
# requests, and every dynamic/static buffer occupies scarce internal RAM.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# mbedTLS heap in PSRAM: a TLS handshake needs ~16 KB in + 4 KB out plus cert
# structures; keeping it in internal RAM starved the BT controller / Wi-Fi and
# made create_ssl_handle fail on 4.3B. MUST stay here so a fresh build/clone
# does not silently regress weather + market TLS.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set

# Board profile: the 4.3 (non-B) board was retired; 4.3B is the target device.
CONFIG_DESK_BOARD_4_3_B=y
# CONFIG_DESK_BOARD_4_3 is not set
# Privacy-safe normal build. First-owner enrollment uses a short-lived recovery
# build that explicitly enables CONFIG_DESK_ALLOW_APP_ENROLLMENT.
# CONFIG_DESK_BRINGUP_DISPLAY_ON is not set
# CONFIG_DESK_ALLOW_APP_ENROLLMENT is not set

# CJK 后备字库外置到 SD：LVGL 用 CLIB malloc 让 ~2.3MB 字体落 PSRAM（内置 64KB 池装不下），
# 并启用 STDIO 文件系统驱动（盘符 'S'=83）读取 /sdcard 上的 .bin 字体。
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_CACHE_SIZE=512
# 字体加载 OOM 时优雅返回 NULL（回退方块），不因 malloc 断言卡死启动。
# CONFIG_LV_USE_ASSERT_MALLOC is not set
# CJK 后备字库为 2bpp 压缩格式（lv_font_conv 默认压缩），必须开启解压，
# 否则后备字符解不出位图、显示为空白/方块。
CONFIG_LV_USE_FONT_COMPRESSED=y

# LVGL fonts needed by the first 800x480 UI skeleton
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
